![alt text](https://4.bp.blogspot.com/-gbL5nZDkpFQ/XScFYwoTEII/AAAAAAAAAGY/CcVb_HDLwvs2Brv5T4vSsUcz7O4r2Q79ACK4BGAYYCw/s1600/kk3-header00-beta.png)<br>


<hr>

#Using Local Server

## Install MySQL

In [1]:
!apt update > /dev/null
!apt install -y  mysql-server > /dev/null
!/etc/init.d/mysql restart
!mysql -e 'create database praxisDB'
!mysql -e 'show databases'

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.


WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

#Using Remote Server

## Set Public Credentials

In [2]:
# enter credentials here
hostName = 'bs60agfnio41zyqiaieh-mysql.services.clever-cloud.com'   # place your own credentials here
userName = 'uhkr8jnu80yg2iqy'      # place your own credentials here
passWord = 'AJwBRu6wGjKYbXwLpXjq'      # place your own credentials here
dbName =  'bs60agfnio41zyqiaieh'         # place your own credentials here

print(hostName,userName,dbName)

bs60agfnio41zyqiaieh-mysql.services.clever-cloud.com uhkr8jnu80yg2iqy bs60agfnio41zyqiaieh

## Set Private Credentials

In [ ]:
#connect to G-Drive
from google.colab import drive
drive.mount('/content/drive')
# copy credentials file
#!ls /content/drive/'My Drive'/Praxis/WebCredentials
#!cp /content/drive/'My Drive'/Praxis/WebCredentials/sqlCredentials_020221.py .
!cp /content/drive/'My Drive'/Praxis/WebCredentials/cleverCloud.py credentials.py
from credentials import hostName,userName,passWord,dbName

#for the sake of privacy
#the following credentials need to be stored in a text file called sqlCredentials.py
#in the format given below
#in the Colab VM


print(hostName,userName,passWord,dbName)

Mounted at /content/drive
bq3ojarbqgmkc7prtopv-mysql.services.clever-cloud.com uxnhrnbgcu47thlz LEEP91xTUEKq36h2DyzT bq3ojarbqgmkc7prtopv

In [3]:
#NOTE SECURITY WARNING
#Passing passwords in the command line is inherently risky and SHOULD NOT BE USED for any non-trivial work
#---------------------------------------------------------------------
!mysql -h '$hostName' -P 3306 -u '$userName' -p'$passWord' '$dbName' -e 'show tables'

mysql: [Warning] Using a password on the command line interface can be insecure.
+--------------------------------+
| Tables_in_bs60agfnio41zyqiaieh |
+--------------------------------+
| CarSalesFact2                  |
| Dept                           |
| Emp                            |
| EmpDataCols                    |
| KeyValueTable                  |
| dept2                          |
| emp2                           |
| emp3                           |
| v_dept1                        |
| v_dept2                        |
| v_employee                     |
+--------------------------------+

# Pythons Functions for SQL commands

In [4]:
!apt install libmysqlclient-dev > /dev/null
!pip install mysqlclient > /dev/null
import pandas as pd
import MySQLdb

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

In [5]:
#To run any non-SELECT SQL command
def runCMD (loc, DDL):
    if loc == 'remoteDB':
        DBConn = MySQLdb.connect(hostName,userName,passWord,dbName)
    elif loc == 'localDB':
        DBConn = MySQLdb.connect(db='praxisDB')
    else :
        print('location must be "remoteDB or "localDB"')
    
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (loc, CMD):
    if loc == 'remoteDB':
        DBConn = MySQLdb.connect(hostName,userName,passWord,dbName)
    elif loc == 'localDB':
        DBConn = MySQLdb.connect(db='praxisDB')
    else :
        print('location must be "remoteDB or "localDB"')
    
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

## Create and Load Tables EMP, DEPT

In [6]:
# Set the location to whichever Database you need to access
#
# --------------------------------
#
#location = 'localDB'
location = 'remoteDB'

In [7]:
# Create and load Emp table
# -----------------------------
runCMD(location,"DROP TABLE IF EXISTS Emp;")
# -----------------------------
runCMD(location,"CREATE TABLE IF NOT EXISTS Emp (\
  EmpID char(6)  NOT NULL,\
  LastName varchar(50),\
  FirstName varchar(50),\
  JobDesc varchar(50),\
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
# -----------------------------
runCMD(location,"INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

0
0
12

In [8]:
# Create and load DEPT table
# --------------------------------
runCMD(location,"DROP TABLE IF EXISTS Dept;")
# --------------------------------
runCMD(location,"CREATE TABLE Dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
# --------------------------------
runCMD(location,"INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

0
0
4

In [9]:
# Check the data
# -------------------------------
runSELECT(location,"select * from Emp, Dept where Emp.DeptID = Dept.DeptID")

     EmpID     LastName FirstName  ...    DeptName ManagerID  Location
0   742866      Bacchan   Amitabh  ...   Corporate    299034  Calcutta
1   349870    Mukherjee      Rani  ...  Production    349870    Bombay
2   865477      Dikshit   Madhuri  ...       Sales    239456  Calcutta
3   239456         Khan  Shahrukh  ...       Sales    239456  Calcutta
4   897889       Sehwag  Virender  ...       Sales    239456  Calcutta
5   123980        Dhoni  Mahender  ...  Production    349870    Bombay
6   822134       Dravid     Rahul  ...    Accounts    822134  Calcutta
7   997445       Dalmia  Jagmohan  ...    Accounts    822134  Calcutta
8   989007      Ganguly    Sourav  ...  Production    349870    Bombay
9   299034      Ganesan     Rekha  ...   Corporate    299034  Calcutta
10  546223  Karthikeyan   Narayan  ...   Corporate    299034  Calcutta
11  223112        Mirza     Sania  ...    Accounts    822134  Calcutta

[12 rows x 12 columns]

In [10]:
location = 'remoteDB'
runSELECT(location,'select * from Emp')

     EmpID     LastName FirstName     JobDesc    JoinDate  Salary  Comm DeptID
0   742866      Bacchan   Amitabh   Executive  2003-03-10   50000  0.10     10
1   349870    Mukherjee      Rani     Manager  2005-05-04   25000  0.06     40
2   865477      Dikshit   Madhuri       Clerk  2002-04-04   10000  0.02     20
3   239456         Khan  Shahrukh     Manager  2004-01-03   30000  0.07     20
4   897889       Sehwag  Virender     Cus_Rep  2005-01-02   15000  0.05     20
5   123980        Dhoni  Mahender       Clerk  2004-10-09    9000  0.02     40
6   822134       Dravid     Rahul  Sr Manager  2000-06-04   40000  0.08     30
7   997445       Dalmia  Jagmohan       Clerk  2001-07-01   12000  0.02     30
8   989007      Ganguly    Sourav     Cus_Rep  2002-01-01   20000  0.03     40
9   299034      Ganesan     Rekha    Director  2002-10-10   60000  0.11     10
10  546223  Karthikeyan   Narayan   Secretary  2005-12-04   40000  0.09     10
11  223112        Mirza     Sania     Cus_Rep  2001-11-19   25000  0.04     30

In [12]:
location = 'remoteDB'
runSELECT(location,'select FirstName,JobDesc from Emp where Salary>30000')

  FirstName     JobDesc
0   Amitabh   Executive
1     Rahul  Sr Manager
2     Rekha    Director
3   Narayan   Secretary

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself. 
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)